{
  "personalInfo": {
    "fullName": "Eren Dhoheiri",
    "email": "dhoheiri@gmail.com",
    "phone": "+6282359024588",
    "linkedin": "https://www.linkedin.com/in/erendhoheiri",
    "website": "",
    "address": "Tangerang, Banten."
  },
  "objective": "Driven by a journey from self-taught developer to engineering manager, my objective is to leverage my extensive technical expertise and leadership acumen to foster high-performing teams and deliver exceptional results. I am committed to guiding projects from inception to success, aligning closely with business objectives while enhancing product quality and performance. Skilled in communication, I excel at translating complex technical details into actionable strategies that resonate with stakeholders, ensuring collaborative success and continuous growth within dynamic and joyful environments.",
  "education": [
    {
      "schoolName": "Universitas Muhammadiyah Yogyakarta",
      "startYear": "2015-06-30T17:00:00.000Z",
      "endYear": "2019-10-31T17:00:00.000Z",
      "location": "Yogyakarta",
      "level": "Bachelor",
      "program": "Management",
      "gpaOptional": "3.6",
      "gpaMaximum": "4",
      "description": "",
      "isCurrentlyStudying": false
    }
  ],
  "workExperience": [
    {
      "companyName": "eFishery",
      "startYear": "2021-10-31T17:00:00.000Z",
      "endYear": "2024-12-29T14:35:40.959Z",
      "location": "Remote",
      "description": [
        "Managed and mentored a diverse team of 6 Backend Engineers and 4 Frontend Engineers, fostering a collaborative and high-performance environment.",
        "Led the planning, execution, and delivery of Internal Tools and Transport Management Systems, ensuring alignment with business objectives and on-time delivery.",
        "Orchestrated efforts across multiple projects by managing dependencies and fostering collaboration between engineering, product, design, and business at the squad or tribe levels.",
        "Conducted technical design reviews to ensure high standards of scalability, reliability, and maintainability, and enforced standardized processes and best practices.",
        "Identified and implemented process improvements to enhance team efficiency, streamline cross-team workflows, and adapt to evolving project needs.",
        "Acted as a liaison between engineering and other departments, providing clear communication on project status, risks, and dependencies."
      ],
      "isCurrentlyWorking": true,
      "employmentType": "Full-time",
      "position": "Engineering Manager"
    },
    {
      "companyName": "Bizzy Indonesia",
      "startYear": "2021-03-31T17:00:00.000Z",
      "endYear": "2021-10-31T17:00:00.000Z",
      "location": "Remote",
      "description": [
        "Build and maintain a supply management application using React for the frontend, Ant Design for UI components, and Redux for state management.",
        "Create backend services using Node.js that run on AWS Lambda with a serverless architecture.",
        "Develop message queuing systems using AWS SNS and SQS to handle asynchronous processes.",
        "Work closely with cross-functional teams including designers, product managers, and fellow developers to translate business requirements into technical solutions"
      ],
      "isCurrentlyWorking": false,
      "employmentType": "Full-time",
      "position": "Software Engineer"
    },
    {
      "companyName": "Kompas Gramedia",
      "startYear": "2020-06-30T17:00:00.000Z",
      "endYear": "2020-11-30T17:00:00.000Z",
      "location": "Jakarta",
      "description": [
        "Build and update websites using Apostrophe CMS, creating user-friendly content management systems.",
        "Create and maintain a collection of standardized code components and functions that can be easily reused across different projects.",
        "Team up with analysts to understand exactly what the business needs and turn those requirements into working features."
      ],
      "isCurrentlyWorking": false,
      "employmentType": "Contract",
      "position": "Software Engineer"
    },
    {
      "companyName": "Celerates",
      "startYear": "2020-02-29T17:00:00.000Z",
      "endYear": "2021-03-31T17:00:00.000Z",
      "location": "Jakarta",
      "description": [
        "Build responsive and interactive front-end interfaces using ReactJS and implement state management with Redux",
        "Offer insights on technology choices and implementation strategies to support successful project outcomes.",
        "Implement best practices in code organization, testing, and deployment across the entire technology stack",
        "Work closely with cross-functional teams including designers, product managers, and fellow developers to translate business requirements into technical solutions"
      ],
      "isCurrentlyWorking": false,
      "employmentType": "",
      "position": "Software Engineer"
    },
    {
      "companyName": "Domosquare",
      "startYear": "2018-06-30T17:00:00.000Z",
      "endYear": "2018-11-30T17:00:00.000Z",
      "location": "Yogyakarta",
      "description": [
        "Handling multiple priorities project and maintaining quality standards across different business units.",
        "Present findings through well-structured reports to support informed decision-making.",
        "Research and gather documentation on company position in the industry."
      ],
      "isCurrentlyWorking": false,
      "employmentType": "Internship",
      "position": "Business Analyst"
    }
  ],
  "certifications": [
    {
      "name": "Javascript Algorithms",
      "year": "2021-10-31T17:00:00.000Z",
      "issuer": "TestDome"
    },
    {
      "name": "Cloud Practioner Essentials",
      "year": "2021-03-31T17:00:00.000Z",
      "issuer": "Dicoding Indonesia"
    },
    {
      "name": "Agile Methodology",
      "year": "2021-06-30T17:00:00.000Z",
      "issuer": "Udemy"
    }
  ],
  "organizations": [
    {
      "organizationName": "Generasi Indonesia Mengabdi",
      "position": "Project Coordinator",
      "startYear": "2016-12-31T17:00:00.000Z",
      "endYear": "2018-05-31T17:00:00.000Z",
      "location": "Lombok, NTB",
      "description": "I helped the project teams manage resources, assigning tasks, controlling schedules, communicating the project’s progress to team members and other stakeholders, and managing the project’s budget.",
      "isCurrentlyActive": false
    }
  ],
  "awards": [],
  "skills": [
    {
      "hardSkill": "Frontend Development, Technical Leadership, Project Management, Version Control, Testing and Debugging",
      "softSkill": "Engineering Management, Leadership, Communication, Problem-Solving, Adaptability, Decision-Making, Team Team Collaboration, Mentorship",
      "softwareSkill": "IDEs, Frontend Frameworks, Project Management Tools (JIRA, Trello, Clickup), Collaboration Tools"
    }
  ],
  "languages": [
    { "name": "Bahasa Indonesia", "level": "Native" },
    { "name": "English", "level": "Intermediate" }
  ],
  "sectionOrder": [
    "objective",
    "personal",
    "experience",
    "certifications",
    "education",
    "organizations",
    "awards",
    "skills",
    "languages",
    "references"
  ]
}
